TDPortal/Codebase/TransportDirect/WebServices/EnhancedExposedServices/bin/GradientProfile/V1/schemas/GradientProfileService.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:s="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.GradientProfile.V1" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" targetNamespace="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.GradientProfile.V1" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <s:schema elementFormDefault="qualified" targetNamespace="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.GradientProfile.V1">
      <s:import namespace="http://microsoft.com/wsdl/types/" />
      <s:element name="GetGradientProfile">
        <s:complexType>
          <s:sequence>
            <s:element minOccurs="0" maxOccurs="1" name="transactionId" type="s:string" />
            <s:element minOccurs="0" maxOccurs="1" name="request" type="tns:GradientProfileRequest" />
          </s:sequence>
        </s:complexType>
      </s:element>
      <s:complexType name="GradientProfileRequest">
        <s:sequence>
          <s:element minOccurs="0" maxOccurs="1" name="Settings" type="tns:Settings" />
          <s:element minOccurs="0" maxOccurs="1" name="PolylineGroups" type="tns:ArrayOfPolylineGroup" />
        </s:sequence>
      </s:complexType>
      <s:complexType name="Settings">
        <s:sequence>
          <s:element minOccurs="1" maxOccurs="1" name="Resolution" type="s:int" />
          <s:element minOccurs="1" maxOccurs="1" name="EastingNorthingSeperator" type="s:int" />
          <s:element minOccurs="1" maxOccurs="1" name="PointSeperator" type="s:int" />
        </s:sequence>
      </s:complexType>
      <s:complexType name="ArrayOfPolylineGroup">
        <s:sequence>
          <s:element minOccurs="0" maxOccurs="unbounded" name="PolylineGroup" nillable="true" type="tns:PolylineGroup" />
        </s:sequence>
      </s:complexType>
      <s:complexType name="PolylineGroup">
        <s:sequence>
          <s:element minOccurs="1" maxOccurs="1" name="ID" type="s:int" />
          <s:element minOccurs="0" maxOccurs="1" name="Polylines" type="tns:ArrayOfPolyline" />
        </s:sequence>
      </s:complexType>
      <s:complexType name="ArrayOfPolyline">
        <s:sequence>
          <s:element minOccurs="0" maxOccurs="unbounded" name="Polyline" nillable="true" type="tns:Polyline" />
        </s:sequence>
      </s:complexType>
      <s:complexType name="Polyline">
        <s:sequence>
          <s:element minOccurs="1" maxOccurs="1" name="ID" type="s:int" />
          <s:element minOccurs="0" maxOccurs="1" name="PolylineGridReferences" type="s:string" />
          <s:element minOccurs="1" maxOccurs="1" name="InterpolateGradient" type="s:boolean" />
        </s:sequence>
      </s:complexType>
      <s:element name="GetGradientProfileResponse">
        <s:complexType>
          <s:sequence>
            <s:element minOccurs="0" maxOccurs="1" name="GetGradientProfileResult" type="tns:GradientProfileResult" />
          </s:sequence>
        </s:complexType>
      </s:element>
      <s:complexType name="GradientProfileResult">
        <s:sequence>
          <s:element minOccurs="0" maxOccurs="1" name="ErrorMessages" type="tns:ArrayOfMessage" />
          <s:element minOccurs="0" maxOccurs="1" name="UserWarnings" type="tns:ArrayOfMessage" />
          <s:element minOccurs="1" maxOccurs="1" name="Resolution" type="s:int" />
          <s:element minOccurs="0" maxOccurs="1" name="HeightGroups" type="tns:ArrayOfHeightPointGroup" />
        </s:sequence>
      </s:complexType>
      <s:complexType name="ArrayOfMessage">
        <s:sequence>
          <s:element minOccurs="0" maxOccurs="unbounded" name="Message" nillable="true" type="tns:Message" />
        </s:sequence>
      </s:complexType>
      <s:complexType name="Message">
        <s:sequence>
          <s:element minOccurs="0" maxOccurs="1" name="Text" type="s:string" />
          <s:element minOccurs="1" maxOccurs="1" name="Code" type="s:int" />
        </s:sequence>
      </s:complexType>
      <s:complexType name="ArrayOfHeightPointGroup">
        <s:sequence>
          <s:element minOccurs="0" maxOccurs="unbounded" name="HeightPointGroup" nillable="true" type="tns:HeightPointGroup" />
        </s:sequence>
      </s:complexType>
      <s:complexType name="HeightPointGroup">
        <s:sequence>
          <s:element minOccurs="1" maxOccurs="1" name="ID" type="s:int" />
          <s:element minOccurs="0" maxOccurs="1" name="HeightPoints" type="tns:ArrayOfHeightPoint" />
        </s:sequence>
      </s:complexType>
      <s:complexType name="ArrayOfHeightPoint">
        <s:sequence>
          <s:element minOccurs="0" maxOccurs="unbounded" name="HeightPoint" type="tns:HeightPoint" />
        </s:sequence>
      </s:complexType>
      <s:complexType name="HeightPoint">
        <s:sequence>
          <s:element minOccurs="1" maxOccurs="1" name="ID" type="s:int" />
          <s:element minOccurs="1" maxOccurs="1" name="Height" type="s:int" />
        </s:sequence>
      </s:complexType>
    </s:schema>
    <s:schema elementFormDefault="qualified" targetNamespace="http://microsoft.com/wsdl/types/">
      <s:simpleType name="char">
        <s:restriction base="s:unsignedShort" />
      </s:simpleType>
    </s:schema>
  </wsdl:types>

  <wsdl:message name="GetGradientProfileSoapIn">
    <wsdl:part name="parameters" element="tns:GetGradientProfile" />
  </wsdl:message>
  <wsdl:message name="GetGradientProfileSoapOut">
    <wsdl:part name="parameters" element="tns:GetGradientProfileResponse" />
  </wsdl:message>
 
  <wsdl:portType name="GradientProfileServiceSoap">
    <wsdl:operation name="GetGradientProfile">
      <wsdl:input message="tns:GetGradientProfileSoapIn" />
      <wsdl:output message="tns:GetGradientProfileSoapOut" />
    </wsdl:operation>
  </wsdl:portType>

  <wsdl:binding name="GradientProfileServiceSoap" type="tns:GradientProfileServiceSoap">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="GetGradientProfile">
      <soap:operation soapAction="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.GradientProfile.V1/GetGradientProfile" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>

  <wsdl:service name="GradientProfileService">
    <wsdl:port name="GradientProfileServiceSoap" binding="tns:GradientProfileServiceSoap">
      <soap:address location="http://www.transportdirect.info/EnhancedExposedServices/GradientProfile/v1/GradientProfileService.asmx" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>


